<template>
  <section class="text-start text-black">
    <h1 class="fw-bolder mb-4 mt-2">Чекори за купување возило на лизинг:</h1>
    <ol type="1" class="fs-3  ps-5 ms-3">
      <li v-for="step in steps" class="mb-3">
        <h3 class="fs-3">{{ step.name }}</h3>
        <p class="fs-5 mb-0">{{ step.description }}</p>
        <p class="fw-bold fs-5 mt-1 pt-1 mt-0 pt-0" v-if="step.name === 'ПРЕЗЕМАЊЕ НА ВОЗИЛОТО'">{{ step.importantNote }}</p>
      </li>
    </ol>
  </section>
</template>

<script>
export default {
  name: "StepsToLeaseACar",
  data() {
    return {
      steps: [
        {
          name: 'ИЗБЕРЕТЕ ГО ВОЗИЛОТО',
          description: `Најпрво го избирате возилото кое сакате да го купите и добивате понуда за истото.
                        Според изборот и понудата се подготвуваат потребните документи.`
        },
        {
          name: 'НАШИТЕ ВРАБОТЕНИ ЌЕ ВИ ГИ ПОБАРААТ ПОТРЕБНИТЕ ПОДАТОЦИ',
          description: `Ги оставате сите потребни податоци на нашите вработени за да ја подготват
                        целокупната документација која е потребна за аплицирање за лизингот.`
        },
        {
          name: 'ПРЕДОДОБРУВАЊЕ',
          description: `Според податоците се преминува на фазата за пред-одобрување која ги елиминира или
                        намалува можностите да бидете одбиени. Затоа е потребно податоците кои ќе ги оставите
                        да бидат точни и прецизни. Лизинг копманијата ја разгледаува вашата апликација
                        и дололку се е во ред ќе Ви го одобрат лизингот и ќе ве известат за тоа. Дополнително
                        ќе ви ги кажат понатамошните чекори.`
        },
        {
          name: 'КАПАР',
          description: `Доколку помине постапката на пред-одобрување потребно е да оставите капар за
                        избраното возило за да Ви биде резервирано се до конечно одобрувањето од банката.`
        },
        {
          name: 'ПРЕЗЕМАЊЕ НА ВОЗИЛОТО',
          description: `Откако ќе се завршите целата процедура и лизингот ќе биде одобрен се договара датумот
                        за превземање на возилото.`,
          importantNote: 'НАПОМЕНА: Пред превземање на возилото потребно е да обезбедите КАСКО ПОЛИСА.'
        }
      ]
    }
  }
}
</script>

<style scoped>

</style>